Repository: nooraalabri/hos_app
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Login
ar: تسجيل الدخول

source: Logout
ar: تسجيل الخروج

source: E-mail
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Dashboard
ar: لوحة التحكم

source: Enter address manually
ar: أدخل العنوان يدويًا

# pickDateRange
source: Select date range
ar: اختيار المدة الزمنية

# medicineNotes
source: Notes
ar: ملاحظات

source: Days passed
ar: الأيام المنقضية

source: Remaining
ar: المتبقي

source: Date range
ar: مدة الدواء

source: Confirm Password
ar: تأكيد كلمة المرور

source: Welcome
ar: مرحبًا

source: Welcome back
ar: مرحبًا بعودتك

# search_patient
source: Search by patient name
ar: بحث باسم المريض

source: Diagnosis
ar: التشخيص

source: Manage Shifts
ar: إدارة المناوبات

# filter_by_date
source: Filter by date range
ar: تصفية حسب التاريخ

source: Clear filters
ar: مسح الفلاتر

source: Add shift
ar: إضافة مناوبة

source: Doctor
ar: الطبيب

source: Date
ar: التاريخ

source: Start
ar: البداية

source: End
ar: النهاية

source: Select date
ar: اختر التاريخ

source: Select time
ar: اختر الوقت

# fill_all_fields
source: Please complete all fields
ar: يرجى تعبئة جميع الحقول

# end_time_error
source: End time must be after start time
ar: يجب أن يكون وقت النهاية بعد وقت البداية

source: Shift added
ar: تمت إضافة المناوبة

source: Shift deleted
ar: تم حذف المناوبة

source: Saving...
ar: جاري الحفظ...

source: Save
ar: حفظ

source: Error:
ar: خطأ:

source: Cancel
ar: إلغاء

source: Delete
ar: حذف

source: Delete shift
ar: حذف المناوبة

# delete_confirm
source: Are you sure you want to delete this shift?
ar: هل أنت متأكد أنك تريد حذف هذه المناوبة؟

# search_doctor_or_spec
source: Search by doctor / specialization
ar: بحث باسم الطبيب أو التخصص

source: Unknown
ar: غير معروف

source: Completed
ar: مكتمل

source: Register
ar: تسجيل

source: Sign up
ar: تسجيل جديد

source: Full name
ar: الاسم الكامل

source: Phone
ar: الهاتف

source: Specialization
ar: التخصص

source: Bio
ar: نبذة

source: Hospital name
ar: اسم المستشفى

source: Location
ar: الموقع

source: About
ar: نبذة عن المستشفى

source: Edit
ar: تعديل

source: Update
ar: تحديث

source: Approve
ar: موافقة

source: Reject
ar: رفض

source: Pending
ar: قيد الانتظار

source: Approved
ar: مقبول

source: Rejected
ar: مرفوض

source: Profile
ar: الملف الشخصي

source: Edit Profile
ar: تعديل الملف الشخصي

source: Doctor Profile
ar: ملف الطبيب

source: Hospital Profile
ar: ملف المستشفى

source: Patient Profile
ar: ملف المريض

source: Home
ar: الصفحة الرئيسية

source: My Shifts
ar: مناوباتي

source: Weekly Shifts
ar: جدولي الأسبوعي

source: Reviews
ar: التقييمات

source: Add Report
ar: إضافة تقرير

source: Medical Record
ar: السجل الطبي

source: Medicines
ar: الأدوية

source: Report
ar: التقرير

source: Save Report
ar: حفظ التقرير

source: View Details
ar: عرض التفاصيل

source: Details
ar: تفاصيل

source: Settings
ar: الإعدادات

source: Language
ar: اللغة

source: Notifications
ar: الإشعارات

source: Dark Mode
ar: الوضع الداكن

source: Light Mode
ar: الوضع الفاتح

source: Change Password
ar: تغيير كلمة المرور

source: Forgot Password?
ar: نسيت كلمة المرور؟

source: Reset Password
ar: إعادة تعيين كلمة المرور

source: Enter Code
ar: أدخل الرمز

source: Send Code
ar: إرسال الرمز

source: Verify
ar: تحقق

# code_sent
source: Verification code sent to your email
ar: تم إرسال الرمز إلى بريدك الإلكتروني

# invalid_code
source: Invalid verification code
ar: الرمز غير صالح

# password_reset_success
source: Password reset successful
ar: تمت إعادة تعيين كلمة المرور بنجاح

# invalid_email
source: Invalid email address
ar: البريد الإلكتروني غير صالح

# required_field
source: This field is required
ar: هذا الحقل مطلوب

source: Weak password
ar: كلمة المرور ضعيفة جدًا

# passwords_not_match
source: Passwords do not match
ar: كلمتا المرور غير متطابقتان

# error_occurred
source: An error occurred
ar: حدث خطأ ما

source: Try again
ar: حاول مرة أخرى

source: Loading...
ar: جار التحميل...

# no_data
source: No data available
ar: لا توجد بيانات

source: Welcome Doctor
ar: مرحبًا دكتور

source: Welcome Patient
ar: مرحبًا أيها المريض

source: Welcome Admin
ar: مرحبًا أيها المدير

source: Pending Approval
ar: في انتظار الموافقة

source: Appointment
ar: موعد

source: Appointments
ar: المواعيد

source: Book Appointment
ar: احجز موعدًا

source: Appointment Confirmed
ar: تم تأكيد الموعد

# appointment_success
source: Your appointment has been booked successfully!
ar: تم حجز الموعد بنجاح!

# today_appointments
source: Today's Appointments
ar: مواعيد اليوم

source: Weekly Appointments
ar: مواعيد الأسبوع

source: Patient Name
ar: اسم المريض

source: Doctor Name
ar: اسم الطبيب

source: Hospital Admin
ar: مسؤول المستشفى

source: Head Admin
ar: المدير العام

source: Add Hospital
ar: إضافة مستشفى

source: Hospital List
ar: قائمة المستشفيات

source: Users
ar: المستخدمون

source: Role
ar: الدور

source: Select Role
ar: اختر نوع الحساب

source: Patient
ar: مريض

source: Hospital
ar: المستشفى

source: Admin
ar: مدير

source: Back
ar: رجوع

source: Confirm
ar: تأكيد

source: Success
ar: تم بنجاح

source: Failed
ar: فشل

source: OTP Code
ar: رمز التحقق

source: Resend Code
ar: إعادة إرسال الرمز

# no_appointments
source: No appointments today
ar: لا توجد مواعيد اليوم

source: View Report
ar: عرض التقرير

source: Add Review
ar: إضافة تقييم

source: Star Rating
ar: تقييم النجوم

source: Send
ar: إرسال

source: Message
ar: الرسالة

source: Feedback
ar: ملاحظاتك

source: Book Now
ar: احجز الآن

source: Hospital Details
ar: تفاصيل المستشفى

source: Doctor Details
ar: تفاصيل الطبيب

source: Search Hospital
ar: بحث عن مستشفى

source: Search Doctor
ar: بحث عن طبيب

source: Search Specialization
ar: بحث عن تخصص

source: View QR
ar: عرض رمز QR

source: Manage Shifts
ar: إدارة المناوبات

source: Filter by date range
ar: تصفية حسب التاريخ

source: Clear filters
ar: مسح الفلاتر

source: Add shift
ar: إضافة مناوبة

# searchDoctorOrSpecialization
source: Search by doctor or specialization
ar: بحث باسم الطبيب أو التخصص

source: Select date
ar: اختر التاريخ

source: Select time
ar: اختر الوقت

# completeAllFields
source: Please complete all fields
ar: يرجى تعبئة جميع الحقول

# endTimeAfterStart
source: End time must be after start time
ar: يجب أن يكون وقت النهاية بعد وقت البداية

# weekdayName
source: Weekday
ar: اليوم

source: Head Admin
ar: المدير العام

source: Review Hospitals
ar: مراجعة المستشفيات

# reviewHospitalsSubtitle
source: Accept or reject new hospital requests
ar: قبول أو رفض طلبات المستشفيات الجديدة

source: Hospital Admin
ar: مسؤول المستشفى

source: My Profile
ar: ملفي الشخصي

# hospitalProfileSubtitle
source: Hospital info & about
ar: معلومات المستشفى و نبذة عنه

source: My Staff
ar: طاقمي الطبي

# myStaffSubtitle
source: Manage doctors & details
ar: إدارة الأطباء وبياناتهم

source: My appointments
ar: مواعيدي

# noAppointments
source: No appointments for today
ar: لا توجد مواعيد اليوم

# timeLabel
source: Time
ar: الوقت

source: Status
ar: الحالة

source: Appointment cancelled
ar: تم إلغاء الموعد

source: Reschedule
ar: إعادة جدولة

source: No available shifts
ar: لا توجد مناوبات متاحة

source: slots available
ar: عدد المواعيد المتاحة: {count}

# rescheduledTo
source: Appointment rescheduled to
ar: تمت إعادة جدولة الموعد إلى

source: Select
ar: اختيار

source: Medical reports
ar: التقارير الطبية

source: No reports
ar: لا توجد تقارير سابقة.

source: Appointment day
ar: يوم الموعد

source: Hospital Name
ar: اسم المستشفى

source: My medicines
ar: أدويتي

source: All
ar: الكل

source: Active
ar: فعال

# noMedicines
source: No medicines found.
ar: لا توجد أدوية.

# civilMustBe8Digits
source: Civil number must be exactly 8 digits
ar: يجب أن يكون الرقم المدني 8 أرقام بالضبط

# phoneMustStartWith7or9
source: Phone number must start with 7 or 9 and be 8 digits
ar: يجب أن يبدأ رقم الهاتف بـ 7 أو 9 ويتكون من 8 أرقام

# patientQr
source: Patient QR Code
ar: رمز الـ QR للمريض

# scanQr
source: Scan this QR code to view patient profile
ar: امسح هذا الرمز لعرض ملف المريض

source: Patient ID not found
ar: لم يتم العثور على رقم المريض

# searchAndBook
source: Search & Book
ar: البحث والحجز

# searchHint
source: Search by hospital, specialization, doctor, or location...
ar: ابحث بالاسم، التخصص، المستشفى أو الموقع...

# hospitalTab
source: Hospital
ar: المستشفيات

# specialisationTab
source: Specialisation
ar: التخصصات

# doctorTab
source: Doctor
ar: الأطباء

source: Not specified
ar: غير محدد

source: View Doctors
ar: عرض الأطباء

# tapSeeDoctors
source: Tap to see doctors in this field
ar: اضغطي لعرض الأطباء في هذا التخصص

source: See Doctors
ar: عرض الأطباء

source: No results
ar: لا توجد نتائج

# noDoctorsForHospital
source: No doctors found for "{name}"
ar: لا يوجد أطباء في "{name}"

# noDoctorsForSpec
source: No doctors found for "{spec}"
ar: لا يوجد أطباء في تخصص "{spec}"

source: Specialisation
ar: التخصص

source: View Shifts
ar: عرض الشفتات

# noShifts
source: No shifts found
ar: لا يوجد شيفتات

source: Time
ar: الوقت

source: Confirm Booking
ar: تأكيد الحجز

# confirmBookingQuestion
source: Book {doctor} on {date} at {time}?
ar: هل تريدين حجز موعد مع {doctor} بتاريخ {date} الساعة {time}؟

# alreadyBookedToday
source: You already have an appointment with {doctor} today.
ar: لديك بالفعل موعد مع {doctor} اليوم.

# slotBooked
source: This time is already booked. Please choose another slot.
ar: هذا الوقت محجوز مسبقاً

# appointmentBooked
source: Appointment booked for {time} with {doctor}
ar: تم حجز الموعد الساعة {time} مع {doctor}

# errorBooking
source: Error booking: {err}
ar: خطأ أثناء الحجز: {err}

# weightHeightInvalid
source: Weight and height must be positive numbers with max 3 digits
ar: يجب أن يكون الوزن والطول أرقامًا صحيحة موجبة وبحد أقصى 3 أرقام

# dob7days
source: Date of birth must be at least 7 days before today
ar: يجب أن يكون تاريخ الميلاد قبل اليوم بـ 7 أيام على الأقل

# profileUpdated
source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح

# profileNotFound
source: User profile not found
ar: لم يتم العثور على ملف المستخدم

source: Edit Profile
ar: تعديل الملف

# personalInfo
source: Personal Information
ar: المعلومات الشخصية

# medicalInfoDoctorOnly
source: Medical Information (Doctor only)
ar: المعلومات الطبية (للطبيب فقط)

# showQr
source: Show QR Code
ar: عرض رمز QR

source: Name
ar: الاسم

# addOrUpdateReport
source: Add / Update Report
ar: إضافة / تحديث تقرير

# reportAddUpdate
source: Add / Update Report
ar: إضافة / تحديث تقرير

source: General Report
ar: التقرير العام

# generalReportHint
source: Write diagnosis or general notes
ar: اكتب التشخيص أو الملاحظات العامة

# generalReportRequired
source: Please enter the report
ar: الرجاء كتابة التقرير

# patientMedicalInfo
source: Patient Medical Information
ar: المعلومات الطبية للمريض

# chronicHint
source: Chronic diseases (separate with commas)
ar: الأمراض المزمنة (افصل بينها باستخدام فاصلة)

# allergyHint
source: Allergies
ar: الحساسية

# medicineSection
source: Prescription
ar: الوصفة الطبية

# medicineName
source: Medicine
ar: الدواء

# medicineDosage
source: Dosage
ar: الجرعة

# medicineDays
source: Days
ar: الأيام

# medicineNameHint
source: Medicine name
ar: اسم الدواء

# medicineDosageHint
source: e.g. 2× daily
ar: مثل 2× يومياً

# medicineNotesHint
source: Notes
ar: ملاحظات

source: Add Medicine
ar: إضافة دواء

source: Previous Reports
ar: التقارير السابقة

source: No details
ar: لا توجد تفاصيل

# dateLabel
source: Date
ar: التاريخ

source: Save Report
ar: حفظ التقرير

# saveReportSuccess
source: Report saved successfully
ar: تم حفظ التقرير بنجاح

# errorPrefix
source: Error:
ar: خطأ:

# requiredField
source: Required
ar: مطلوب

# writeDiagnosis
source: Write diagnosis or general notes
ar: اكتب التشخيص أو الملاحظات العامة

# reportRequired
source: Please write the report
ar: الرجاء كتابة التقرير

# chronicDiseasesHint
source: Chronic diseases (separate by comma)
ar: الأمراض المزمنة (افصل بينها باستخدام فاصلة)

source: Allergies
ar: الحساسية

source: Prescription
ar: الوصفة الطبية

source: Medicine
ar: الدواء

source: Dosage
ar: الجرعة

source: Days
ar: أيام

source: Notes
ar: ملاحظات

# dosageExample
source: e.g. 2× daily
ar: مثل 2× يومياً

# noPreviousReports
source: No previous reports found.
ar: لا توجد تقارير سابقة.

# reportSaved
source: Report saved successfully
ar: تم حفظ التقرير بنجاح

source: Civil Number
ar: الرقم المدني

# dob
source: Date of Birth
ar: تاريخ الميلاد

# weight
source: Weight (kg)
ar: الوزن (كجم)

# height
source: Height (cm)
ar: الطول (سم)

source: Blood Type
ar: فصيلة الدم

source: Chronic Diseases
ar: الأمراض المزمنة

source: Medications
ar: الأدوية

source: Condition
ar: الحالة الصحية

# editPersonalInfo
source: Edit Personal Information
ar: تعديل المعلومات الشخصية

source: Schedule
ar: الجدول

# activeLabel
source: Active
ar: نشط

source: Yes
ar: نعم

source: No
ar: لا

source: Search
ar: بحث

# reportsOverview
source: Weekly / Monthly / Yearly
ar: أسبوعي / شهري / سنوي

source: Add doctor
ar: إضافة دكتور

source: Reports
ar: التقارير

# reportsSubtitle
source: View each hospital details and statistics
ar: عرض تفاصيل وإحصائيات كل مستشفى

# dashboardSubtitle
source: Weekly / Monthly / Yearly overview
ar: نظرة أسبوعية / شهرية / سنوية

source: Shift added
ar: تمت إضافة المناوبة

source: Shift updated
ar: تم تحديث المناوبة

source: Shift deleted
ar: تم حذف المناوبة

# deleteConfirm
source: Are you sure you want to delete this shift?
ar: هل أنت متأكد أنك تريد حذف هذه المناوبة؟

# scan_qr
source: Scan QR Code
ar: مسح رمز QR

# qr_info
source: Scan QR to view patient information
ar: امسح الرمز لرؤية معلومات المريض

source: Generate QR
ar: إنشاء رمز QR

# qr_generated
source: QR code generated successfully
ar: تم إنشاء الرمز بنجاح

# notifications_settings
source: Notification Settings
ar: إعدادات الإشعارات

source: New Appointment
ar: موعد جديد

source: Appointment Reminder
ar: تذكير بالموعد

source: Full name
ar: الاسم الكامل

source: Address
ar: العنوان

# profileImageUrl
source: Profile Image URL (optional)
ar: رابط صورة الملف (اختياري)

source: Save Changes
ar: حفظ التعديلات

# saveSuccess
source: Profile updated successfully!
ar: تم تحديث الملف بنجاح!

# fillRequired
source: Please fill all required fields.
ar: يرجى ملء جميع الحقول المطلوبة.

# saveError
source: Error saving profile:
ar: خطأ أثناء حفظ البيانات:

source: Medical Record
ar: السجل الطبي

# medicalInfo
source: Medical Information
ar: المعلومات الطبية

source: Update Medical Record
ar: تحديث السجل الطبي

# medicalRecordUpdated
source: Medical record updated successfully
ar: تم تحديث السجل الطبي بنجاح

source: Today's Appointments
ar: مواعيد اليوم

source: Add / Update Report
ar: إضافة / تحديث تقرير

source: Appointment Completed
ar: تم إكمال الموعد

source: Doctor Reviewed
ar: تم تقييم الطبيب

source: Report Details
ar: تفاصيل التقرير

source: Report Date
ar: تاريخ التقرير

source: Doctor Approval Requests
ar: طلبات موافقة الأطباء

# no_pending_doctors
source: No pending doctor requests
ar: لا توجد طلبات أطباء قيد الانتظار

source: Accept
ar: موافقة

# doctor_approved_msg
source: Doctor has been approved
ar: تمت الموافقة على الطبيب

# doctor_rejected_msg
source: Doctor has been rejected
ar: تم رفض الطبيب

# approved_email_subject
source: Doctor Account Approved
ar: تمت الموافقة على حسابك

# approved_email_text
source: Your account has been approved.
ar: تمت الموافقة على حسابك من قبل الإدارة.

# rejected_email_subject
source: Doctor Account Rejected
ar: تم رفض حسابك

# rejected_email_text
source: Your account has been rejected.
ar: نأسف، تم رفض طلب تسجيلك.

source: Hospital Approval Requests
ar: طلبات موافقة المستشفيات

# no_pending_hospitals
source: No pending hospital requests
ar: لا توجد طلبات مستشفيات قيد الانتظار

source: License Number
ar: رقم الترخيص

# cr_number
source: Commercial Reg. No
ar: رقم السجل التجاري

# location_label
source: Location
ar: الموقع

source: Website
ar: الموقع الإلكتروني

source: Created At
ar: تاريخ الإنشاء

source: Image not available
ar: الصورة غير متوفرة

# hospital_approved_msg
source: Hospital has been approved
ar: تمت الموافقة على المستشفى

# hospital_rejected_msg
source: Hospital has been rejected
ar: تم رفض المستشفى

# approval_email_subject
source: Hospital Approval
ar: موافقة على المستشفى

# approval_email_text
source: Your hospital has been approved by the administration.
ar: تمت الموافقة على المستشفى من قبل الإدارة.

# rejection_email_subject
source: Hospital Rejection
ar: رفض المستشفى

# rejection_email_text
source: Your hospital registration has been rejected.
ar: تم رفض تسجيل المستشفى.

source: New Password
ar: كلمة المرور الجديدة

source: Doctor Profile
ar: ملف الدكتور

source: Quick Access
ar: الوصول السريع

source: My Shifts
ar: شيفتاتي

source: Weekly Shifts
ar: مناوبات الأسبوع

source: Doctor Menu
ar: قائمة الدكتور

source: Doctor details
ar: تفاصيل الطبيب

source: Enter recovery code
ar: أدخلي رمز الاستعادة

# invalidOrExpired
source: Invalid or expired code
ar: الرمز غير صحيح أو منتهي

# forgotPasswordTitle
source: Forgot password
ar: نسيتِ كلمة المرور

source: Enter valid email
ar: أدخلي بريد إلكتروني صحيح

# failedToSend
source: Failed to send code. Try again.
ar: فشل إرسال الرمز. أعيدي المحاولة.

source: Weekly
ar: أسبوعي

source: Monthly
ar: شهري

source: Yearly
ar: سنوي

source: Hospitals (approved)
ar: المستشفيات (مقبولة)

source: Hospitals (pending)
ar: المستشفيات (قيد المراجعة)

source: Doctors (approved)
ar: الأطباء (مقبولون)

source: Doctors (pending)
ar: الأطباء (قيد المراجعة)

source: Patients (total)
ar: عدد المرضى

source: New users
ar: مستخدمون جدد

source: New hospitals
ar: مستشفيات جديدة

source: Hospitals Overview
ar: عرض المستشفيات

# noApprovedHospitals
source: No approved hospitals available
ar: لا توجد مستشفيات معتمدة

source: City
ar: المدينة

# hospitalStats
source: Stats
ar: الإحصائيات

# noData
source: No data available
ar: لا توجد بيانات

source: Doctors
ar: الأطباء

source: Patients
ar: المرضى

source: Edit Hospital
ar: تعديل المستشفى

source: Hospital details
ar: تفاصيل المستشفى

source: Hospital Reports
ar: تقارير المستشفى

source: Hospital Overview
ar: نظرة عامة على المستشفى

source: New register
ar: تسجيلات جديدة

source: Visits
ar: الزيارات

source: Doctor Reports
ar: تقارير الأطباء

source: Patient Reports
ar: تقارير المرضى

source: Welcome back
ar: مرحباً بعودتك

source: Enter your email
ar: أدخلي بريدك الإلكتروني

# min8chars
source: Min 8 characters
ar: الحد الأدنى 8 أحرف

# forgotPasswordQ
source: Forgot Password?
ar: نسيتِ كلمة المرور؟

source: New user?
ar: مستخدمة جديدة؟

source: Sign up
ar: إنشاء حساب

source: Login failed.
ar: فشل تسجيل الدخول.

# noAccountForEmail
source: No account found for this email.
ar: لا يوجد حساب لهذا البريد.

source: Incorrect password.
ar: كلمة المرور غير صحيحة.

# invalidCredential
source: Invalid email or password.
ar: بيانات تسجيل الدخول غير صحيحة.

source: Unknown role
ar: دور غير معروف

source: No doctors
ar: لا يوجد أطباء

source: Close
ar: إغلاق

source: Delete doctor
ar: حذف الطبيب

# deleteDoctorConfirm
source: Are you sure you want to delete this doctor?
ar: هل أنتِ متأكدة من حذف هذا الطبيب؟

source: Doctor deleted
ar: تم حذف الطبيب

source: Pending Approval
ar: قيد الموافقة

# requestSubmitted
source: Your request has been submitted!
ar: تم إرسال طلبك!

# reviewingRegistration
source: We are reviewing your registration. You will be notified once your request is approved.
ar: جاري مراجعة تسجيلك. سيتم إعلامك عند الموافقة.

source: Signed in as:
ar: تم تسجيل الدخول كـ:

source: Check again
ar: تحقّق مرة أخرى

source: Register Doctor
ar: تسجيل دكتور

source: Valid email required
ar: يرجى إدخال بريد صحيح

source: Select hospital
ar: اختر مستشفى

# passwordRequired
source: Password is required
ar: كلمة المرور مطلوبة

# passwordRules
source: Min 8 chars incl. upper, lower, number & special
ar: ٨ أحرف على الأقل وتشمل حرف كبير، صغير، رقم ورمز

source: Confirm Password
ar: تأكيد كلمة المرور

# confirmPasswordRequired
source: Please re-enter password
ar: يرجى إعادة إدخال كلمة المرور

source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

source: Required
ar: هذا الحقل مطلوب

# noHospitalsFound
source: No approved hospitals found. Please try again later.
ar: لا توجد مستشفيات معتمدة. يرجى المحاولة لاحقًا.

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟

source: Register Hospital
ar: تسجيل مستشفى

source: Enter official hospital name
ar: أدخلي الاسم الرسمي للمستشفى

source: License Number
ar: رقم الترخيص

source: MOH license number
ar: رقم ترخيص وزارة الصحة

# crNumber
source: Commercial Registration Number
ar: رقم السجل التجاري

source: Enter CR number
ar: أدخلي رقم السجل التجاري

source: Phone Number
ar: رقم الهاتف

source: Enter valid number
ar: أدخلي رقماً صحيحاً

# passwordRulesFull
source: Min 8 chars, must include upper/lower/number/symbol
ar: ١٠ أحرف على الأقل وتشمل حرف كبير وصغير ورقم ورمز

source: Address / Location
ar: العنوان / الموقع

# enterFullAddress
source: Full address or Google Maps link
ar: العنوان الكامل أو رابط Google Maps

source: Website (optional)
ar: الموقع الإلكتروني (اختياري)

source: My Name
ar: اسمي

source: Date of Birth
ar: تاريخ الميلاد

# civilMustBe8
source: Must be exactly 8 digits
ar: يجب أن يكون 8 أرقام

# passwordsNotMatch
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# resetPasswordTitle
source: Reset password
ar: إعادة تعيين كلمة المرور

source: New password
ar: كلمة المرور الجديدة

source: Enter new password
ar: أدخلي كلمة المرور الجديدة

source: Confirm new password
ar: تأكيد كلمة المرور الجديدة

source: Re-enter new password
ar: أعيدي إدخال كلمة المرور

# passwordHintText
source: Password must have at least 8 characters, including upper & lower letters, a number, and a special character.
ar: يجب أن تحتوي كلمة المرور على ٨ أحرف على الأقل تشمل حرف كبير، صغير، رقم ورمز.

# passwordUpdated
source: Password updated successfully
ar: تم تحديث كلمة المرور بنجاح

# emailResetLink
source: We emailed you a reset link. Please check your inbox.
ar: تم إرسال رابط إعادة التعيين إلى بريدك.

# noEmailFound
source: No email found for reset.
ar: لا يوجد بريد لاستخدامه في إعادة التعيين.

# stillPending
source: Still pending. Please try again later.
ar: ما زال الطلب قيد الانتظار. يرجى المحاولة لاحقًا.

source: Not logged in
ar: غير مسجل دخول

# selectRole
source: Select your role
ar: اختاري الدور

# roleHospital
source: Hospital
ar: مستشفى

# roleDoctor
source: Doctor
ar: دكتور

# rolePatient
source: Patient
ar: مريض

# welcomeTitle
source: Hospital Appointment
ar: نظام مواعيد المستشفى

source: Accept / Reject
ar: قبول / رفض

source: Chatbot
ar: المساعد الذكي

source: Pick location on map
ar: اختر الموقع على الخريطة

source: Confirm Location
ar: تأكيد الموقع

# pickFromMap
source: Tap to pick location from map
ar: اضغطي لاختيار الموقع من الخريطة

source: User profile not found.
ar: لم يتم العثور على ملف المستخدم.

# pendingApprovalTitle
source: Pending Approval
ar: قيد الموافقة

source: Patient Reviews
ar: تقييمات المرضى

# noReviews
source: No reviews yet
ar: لا توجد تقييمات بعد

# noComment
source: No comment provided
ar: لا توجد ملاحظات

source: Daily
ar: يومي

# statusLabel
source: Status
ar: الحالة

# noAppointmentsInShift
source: No appointments in this shift
ar: لا توجد مواعيد في هذا الشيفت

# thank_you
source: Thank you for using our app!
ar: شكرًا لاستخدامك تطبيقنا!
